<template>
  <layout>
    <Api :data="item" />
  </layout>
</template>

<script>
export default {
  data() {
    return {
      item: {
        url: "/commodity/:page/:count",
        urlObj: {
          keys: [
            { key: "note", label: "注释" },
            { key: "field", label: "字段" },
            { key: "type", label: "类型" },
          ],
          list: [
            {
              note: "第几页",
              field: "page",
              type: "Number",
            },
            {
              note: "要几条数据",
              field: "count",
              type: "Number",
            },
          ],
          dataType: "/category/1/10",
        },
        method: "POST",

        form: {
          keys: [
            { key: "note", label: "注释" },
            { key: "field", label: "字段" },
            { key: "type", label: "类型" },
          ],
          list: [
            {
              note: "父级id 可选参数",
              field: "parent_id",
              type: "Number",
            },
            {
              note: "token",
              field: "token",
              type: "String",
            },
          ],
        },
        res: {
          keys: [
            { key: "note", label: "注释" },
            { key: "field", label: "字段" },
            { key: "type", label: "数据类型" },
          ],
          list: [
            { note: "数据总量", field: "total", type: "Number" },
            { note: "id", field: "id", type: "Number" },
            { note: "商品名字", field: "name", type: "String" },
            { note: "创建时间", field: "create_date", type: "String" },
            { note: "简介", field: "desc", type: "String" },
            { note: "售价", field: "sell_price", type: "Number" },
            { note: "库存", field: "count", type: "Number" },
            { note: "标签", field: "label", type: "String" },
            { note: "是否下架", field: "state", type: "Number" },
            { note: "商品主图", field: "main_image_url", type: "String" },
            { note: "分类id", field: "category.id", type: "Number" },
            { note: "分类名字", field: "category.name", type: "String" },
            { note: "商品详情", field: "content", type: "String" },
          ],
          dataType: {
            total: 26930,
            list: [
              {
                id: 89,
                name: "去边变青温。",
                create_date: "1993-05-07 19:32:15",
                desc: "快劳准来日到素来儿真第律。气度许地法方音育动因北温目。克听业除设才际表道革低世战老题值国。有员今专点面五号认造达合你热等整千。",
                sell_price: 4165,
                count: 7379,
                label: "笔记本",
                state: 1,
                main_image_url: "http://dummyimage.com/300x300",
                category: {
                  id: 5406,
                  name: "阶却作总才。",
                },
                content:
                  "及料同所先王又证件里持别效证。和术基关加后维年管成或造住林运通由。维么由般证构之义其开织你还。万始火调结成深界亲包领心效设。发细程光目海件少断于下研张从全和土儿。被总听且历以外被利般内权使养积。观厂经解性通按县许事府矿论认的深长段。教自置王教发认心几就约具矿产华。通被马子革见划局低外适要极群长。号快两商改革声系身带最来已格。交克子林线济作住亲半资效况京通层除往。题公者边打住才条况交十走多型须。清则般较取最方听进传亲在想。示果严只活思处接里步义按义北全。别受时高那确般厂治交情毛那格那。最元命提派式律种几亲土组月。反思比整等律由行科每统增把口广里时。为可条性联布反火务重强识确证作。验制常每府群如则整界命果长近。图及斗去离织铁强外非验技。",
              },
              {
                id: 26,
                name: "只维南次平。",
                create_date: "1970-07-17 14:51:09",
                desc: "决西而那别至太什间计很声往存这除。人十验太与亲引交铁北求来记。花理半受要革风社导每数及增约。团作龙受大内她美称起广接社山斗将即。",
                sell_price: 346,
                count: 5113,
                label: "笔记本",
                state: 1,
                main_image_url: "http://dummyimage.com/300x300",
                category: {
                  id: 6117,
                  name: "才办指东严。",
                },
                content:
                  "说收究界量事律为米片共究。每石山所美共色构向么法周果。广这观除规战价状级次不内写原题济难角。京气联约决风织斯织组各积论平。产育面县学或更后点复标又组。则反五直劳火石团影较期支。近整天何党酸风产王引传提门。将属包科感从大利知求快安。正组基果色社结技太素根保那程百。于快光目认规期争斗质切气何第清。它响八往格大百相精计切构志例易家。受报求构三毛经集百组入存区于。断风集力面极科划山转本还存真。周红劳林命际动要流写论验。集按个张里切加专增而管成划备华。取算名科马这圆志农满较增。把据指张及术她体里格断作调七政两。才应来地此管管命器制易理得阶表。小路标之体住民看制准记油。名车府重育织出家子说之说十共经自。",
              },
              {
                id: 67,
                name: "群收再建治。",
                create_date: "2001-11-15 05:26:51",
                desc: "三同文细二它号备比行名基光划应支技。热众商九对龙界目而眼我全观老门构。王题可元素经但律素起究温称断至江建。万化何技而加基学面东式毛业。",
                sell_price: 7111,
                count: 6309,
                label: "笔记本",
                state: 1,
                main_image_url: "http://dummyimage.com/300x300",
                category: {
                  id: 2529,
                  name: "划下克人开。",
                },
                content:
                  "体机儿先备些见南而次持还。三至红划劳此她与江电中之风许。经本共南白半需任南七决最一正图示员。族通证信应适清年国基一导干。边价月全很领质查取共心被斗非。应前信周铁住务化拉意部存。之任很口入计准取育达广阶达行油来。电石受成党验风文化小合示。单论识属毛布入严事月斗红保飞。志各原子下非色管每团结金片白发教信。他你片圆听上身会者断府则按流分格最。真此流本派同区还由县太取到位。动加林行段题动每动织南进真先价国办各。时起次了行图他布农他地克备政。技住论身清气阶水年打易集样人马高。共阶当四北石选去识又世此要六联话。次见往面委最然通意结单火型。日全权区中米装领真实矿美再个观器常或。般又二派那地省己收广业存那通象月则好。精记派候长是划强元没百清华五参速示。",
              },
              {
                id: 39,
                name: "已拉水术图。",
                create_date: "1984-09-29 05:32:49",
                desc: "队之战题规表该没却构教际须信导织次。改圆九按离立存光装好造组见处。其复无较文什标线消市快报。观指做性非写究包史子军代。",
                sell_price: 3974,
                count: 1931,
                label: "笔记本",
                state: 0,
                main_image_url: "http://dummyimage.com/300x300",
                category: {
                  id: 3245,
                  name: "己国与革美。",
                },
                content:
                  "效第派些合元存原合社得马。花速铁期本保干号别自很求利。五达山头马部织声状心需管来有转。代比象当感委达场任二外应正条花非群已。全养小称听明命感记保导省三可。没者精高走意习先调精又月论流是头。多单适体院物物装带眼时或。技局六两上际论高张斯完北技节京究。者内查矿来县府最石果具件打以目且。人资交青备家音反张易低育该识属许或。派角因即眼所确林器质见重且。且般不什照状转容都变外把阶手者。国是节低果现展下直广没问林级一积才要。接己系照然给圆术办省它话设较两。候压意只其得问办信点造育集便响专。些取真历条石切还何着能此几风开类。改价选本率建确指手导即查号但律。照几会程月之间比问整确段位干记加广可。此空动总提切理管革查马是产除员名由。常响林八那听出口圆定设开律何亲。",
              },
              {
                id: 40,
                name: "少无正毛重。",
                create_date: "1978-04-13 01:58:05",
                desc: "住手走道安无建发其她规把外车。结该装增思万和体史过话由。受龙象指间学美养利们组压住。委时活又而第方第满不织它始律油名。",
                sell_price: 2692,
                count: 5200,
                label: "笔记本",
                state: 0,
                main_image_url: "http://dummyimage.com/300x300",
                category: {
                  id: 1804,
                  name: "节思属体情。",
                },
                content:
                  "集建话动它会上技七因一果根压达应音。采三极复说总标造个科半作向置空平。都方片位多公提业象合广七领处完做保。属标记向海件用无受完效火。济况完石提西值集整给花样华委断酸素。求次王人确向江上级能是济声造。些始别我知调科团且相七切划白。交制济想时第格义结也海值想群电之。集六低实眼红划据积地至资圆反越养。己众也量北已量办越形声了千中有。矿长政层严口属过商么六强。全保需联按空真织发车把布取率军率。来县同厂接她她快准加已子清安千于。照增克程海数条定看打往书听高相我许。来采有才五参段议知长统条比。导白手资提说叫第济往难比生很则九。状平气形业已应会线示入点属往反下成。果转农数活强般斯间除把育动水气第列。该被是按生已总己效什事引种生研正。能领信高党新张你现究调府专。",
              },
            ],
          },
        },
      },
    };
  },
  metaInfo: {
    title: "Hello, world!",
  },
};
</script>

<style>
.el-collapse-item__header {
  font-weight: 800;
  font-size: 16px;
}
</style>